app/views/programs/_sidebar.html.erb

SELECT `downloads`.* FROM `downloads` WHERE (user_id = 141 AND title IS NOT NULL OR program_id > 0) ORDER BY created_at DESC LIMIT 10
SELECT `programs`.* FROM `programs` WHERE (`programs`.`id` IN (51,275,225,271,278,255,248,190))
SELECT `users`.* FROM `users` WHERE (`users`.`id` IN (8,128,81,100,129,24,93,47))
---
	<ul class="vertical green-text float-right dejavu-condensed">
		<% Download.where("user_id = ? AND title IS NOT ? OR program_id > ?", @program.user, nil, 0).includes(:program, :user).order("created_at DESC").limit(10).each do |d| %>