app/views/users/_feed.html.erb

SELECT `feeds`.* FROM `feeds` WHERE (`feeds`.user_id = 1) LIMIT 1
---
	});
	$(".refresh").click(function(){
		$(".feed.all a").click();
	});