app/views/schedules/index.html.erb

SELECT `events`.* FROM `events` WHERE (starts_at <= '18:0' and ends_at >= '18:0' and day_i = 2) LIMIT 1
---

	  $.getJSON('/schedules/', function(data) {
	  $.each(data['events'], function(i, data){
			console.log(data)
			var hour = data['starts_at'].split("\:")[0]
			var day = data['day_i']
			var duration = data['duration']
			var cellSelector = "td[data-date=\""+day+"\"][data-hour=\""+hour+"\"]"
			var txt = "<a href=\"" + data['url'] +"\">" + data['name'] + "</a>"
			var description = "<a>" + data['description'] + "</a>"
			$(cellSelector).html(txt);
			if(duration > 1){
				if((hour.split("0")[0] == 0)) {
					var h = hour.split("0").pop();
					var nHour = parseInt(h) + 1
					nHour = "0" + nHour
				}else{
					var nHour = parseInt(hour) + 1
				}
				var addCellSelector = "td[data-date=\""+day+"\"][data-hour=\""+nHour+"\"]"
				$(addCellSelector).html(txt);
			}