app/controllers/catalogs_controller.rb

  def index

    if params[:alphabetical]
      @catalogs = Catalog.paginate(:all, :order => "artist ASC", :page => params[:page], :conditions => [ 'artist LIKE ?', "#{params[:alphabetical]}%" ])
---
SELECT COUNT(*) FROM `catalogs`
SELECT `catalogs`.* FROM `catalogs` ORDER BY number DESC LIMIT 30 OFFSET 0