app/controllers/comments_controller.rb

SELECT `comments`.* FROM `comments` WHERE (program_id = '290') ORDER BY created_at DESC
---
  def index
    if params[:type]
      if params[:type] == "post"
        @comments = Comment.order('created_at DESC').where("post_id = ?", params[:id])