app/controllers/contents_controller.rb

  def view
    if params[:title] != nil && params[:title].size > 0
      @content = Content.find_by_title(params[:title])
      if @content.title.split(" ").size > 1
        @title = ""
        @content.title.split(" ").each do |u|
          if u.downcase == "kpsu"
            @title += "#{u.upcase}"
          else
            @title += "#{u.capitalize} "
          end
        end
      else
        @title = @content.title.capitalize
      end
      respond_to do |format|
        format.html # show.html.erb
        format.xml  { render :xml => @content }
      end
    else
      @content = Content.find(params[:id])
---
SELECT `contents`.* FROM `contents` WHERE (`contents`.`id` = 6) LIMIT 1