app/controllers/handbook_pages_controller.rb

SELECT `handbook_pages`.* FROM `handbook_pages`
---
  def index
    @handbook_pages = HandbookPage.all