app/controllers/playlists_controller.rb

UPDATE `users` SET `last_request_at` = '2012-01-07 20:56:59', `perishable_token` = 'wBc98rwC14yV0V9fYeqV', `updated_at` = '2012-01-07 20:56:59' WHERE (`users`.`id` = 1)
---
  def create
    @i = 0
    @title = params[:playlist][:title]
    @description = params[:playlist][:description]
    @tmp_tracks = params[:tracks].split(",")
    @program = Program.find(params[:programs])

    #If it's a one-hour show
    if params[:download]
      @playlist = Playlist.new(:title => @title, :program => @program, :description => @description, :user_id => current_user.id)
      @playlist.save
      @playlist.reload
      unless params[:curently_playing] == "true"
        @download = Download.find(params[:download])
        @download.update_attributes(:playlist_id => @playlist.id)