app/controllers/playlists_controller.rb

  def index
    @inpage = params[:inpage]
    @playlists = current_user.playlists.order("created_at DESC").paginate(:page => params[:page], :per_page => 25)
---
SELECT `playlists`.* FROM `playlists` WHERE (`playlists`.user_id = 1) ORDER BY created_at DESC LIMIT 25 OFFSET 0

  def search
    if params[:track_search]

      @artists = []
      @albums = []
      @tracks = []

      if params[:artist_search]
        @results = Artist.name_like(params[:search])
        @aa = @artists.map{|a| a.id }
        @artists = Track.find_all_by_artist_id(@aa) rescue nil
      end

      if params[:album_search]

        @albums = Album.name_like(params[:search])
        @aa = @albums.map{|a| a.id }
        @tracks = Track.find_all_by_album_id(@aa) rescue nil
      end

      if params[:search_type] == "tracks"
        @tracks = Track.title_like(params[:search]) rescue nil
      else
      end

      if @tracks && @tracks.size > 0
---
SELECT `tracks`.* FROM `tracks` WHERE (`tracks`.`artist_id` IN (12793, 23751, 38419, 38747))
SELECT COUNT(*) FROM `tracks` WHERE (tracks.title LIKE '%sleepyhead%')
SELECT `tracks`.* FROM `tracks` WHERE (tracks.title LIKE '%sleepyhead%')


      if params[:search_type] == "artist"
        @artists = Artist.name_like(params[:search])
        @aa = @artists.map{|a| a.id }
---
SELECT `artists`.* FROM `artists` WHERE (artists.name LIKE '%Wu Tang%')

  def new
    @inpage = params[:inpage]
    @playlist = Playlist.new
    @psetup = Program.all
---
SELECT `programs`.* FROM `programs` WHERE (`programs`.user_id = 1) LIMIT 1

  def create
    @i = 0
    @title = params[:playlist][:title]
    @description = params[:playlist][:description]
    @tmp_tracks = params[:tracks].split(",")
    @program = Program.find(params[:programs])
    @download = Download.find(params[:downloads])
    #here i am attempting to extract the variable (downloads) taken in from the form (on the view.)
    #i belive an error may lie in the local variable @download taking the entire object instead of just the string
    #then, below, when we initialize a playlist object below, it's taking a bad format for that attribute
    #@playlist = Playlist.new(:title => @title, :program => @program, :description => @description, :user_id => current_user.id)
    @playlist = Playlist.new(:title => @title, :program => @program, :description => @description, :user_id => current_user.id, :download_id => @download.id)
    @playlist.save
    @playlist.reload

    #@download.playlist_id = @playlist.id

    @i = 0
    @tmp_tracks.each do |track|
      @i += 1
      @track = Track.find(track)
      @pi = PlaylistItem.new
      @pi.track = @track
      @pi.playlist = @playlist
      @pi.position = @i
      @pi.save
---
SELECT `programs`.* FROM `programs` WHERE (`programs`.`id` = 273) LIMIT 1
INSERT INTO `playlists` (`program_id`, `title`, `description`, `created_at`, `updated_at`, `nid`, `user_id`) VALUES (271, 'Demo Playlist', 'Making a playlist', '2012-01-07 21:10:12', '2012-01-07 21:10:12', NULL, 1)
SELECT `tracks`.* FROM `tracks` WHERE (`tracks`.`id` = 108086) LIMIT 1
INSERT INTO `playlist_items` (`playlist_id`, `position`, `created_at`, `updated_at`, `nid`, `track_id`) VALUES (9978, 1, '2012-01-07 21:10:12', '2012-01-07 21:10:12', NULL, 108086)

  def update
    @ii = 0
    @playlist = Playlist.find(params[:id])
    @program = Program.find(params[:programs])
    @download = Download.find(params[:downloads])

    @playlist.update_attributes(:download_id => @download.id)
    @tmp_tracks = params[:tracks].split(",")
    @playlist.playlist_items.each do |pi|
        pi.destroy
    end
    Rails.logger.info(@tmp_tracks.length)
    @tmp_tracks.each do |track|
      @ii += 1
      @track = Track.find(track)
      @pi = PlaylistItem.new
      @pi.track = @track
      @pi.playlist = @playlist
      @pi.position = @ii
      @pi.save
---
SELECT `playlists`.* FROM `playlists` WHERE (`playlists`.`id` = 9986) LIMIT 1
SELECT `programs`.* FROM `programs` WHERE (`programs`.`id` = 273) LIMIT 1
SELECT `playlist_items`.* FROM `playlist_items` WHERE (`playlist_items`.playlist_id = 9986)
SELECT `tracks`.* FROM `tracks` WHERE (`tracks`.`id` = 43309) LIMIT 1
INSERT INTO `playlist_items` (`playlist_id`, `position`, `created_at`, `updated_at`, `nid`, `track_id`) VALUES (9986, 1, '2012-01-07 21:19:54', '2012-01-07 21:19:54', NULL, 43309)