app/controllers/posts_controller.rb

  def index
    @user_session = UserSession.new

    unless params[:page]
    @downloads = Download.find(:all, :limit => 5, :order => "downloads.created_at DESC", :include => [:user, :program], :conditions => ['downloads.user_id IS NOT ? AND downloads.program_id IS NOT ? AND downloads.program_id > ?', nil, nil, 0])
    @start = Date.strptime("12/31/2010 01:01:01", "%m/%d/%Y %H:%M").to_time
    @rev = Review.order("created_at DESC").limit(5)
    @post = Post.where(:content_type_id => 1).order("created_at DESC").limit(2)

    if params[:blog]
      @posts = Post.paginate(:all, :order => "created_at DESC", :conditions => ['content_type_id = ? AND created_at > ?', 1, @start], :per_page => 7, :page => params[:page])
    elsif params[:review]
      @posts = Post.paginate(:all, :order => "created_at DESC", :conditions => ['content_type_id = ? AND created_at > ?', 1, @start], :per_page => 7, :page => params[:page])
    else
      @posts = Post.where('posts.created_at > ?', @start).includes(:user).order("posts.created_at DESC").paginate(:per_page => 7, :page => params[:page])
---
SELECT `downloads`.* FROM `downloads` WHERE (downloads.user_id IS NOT NULL AND downloads.program_id IS NOT NULL AND downloads.program_id > 0) ORDER BY downloads.created_at DESC LIMIT 5
SELECT `programs`.* FROM `programs` WHERE (`programs`.`id` IN (51,275,225,271,278))
SELECT `users`.* FROM `users` WHERE (`users`.`id` IN (8,128,81,100,129))
SELECT `reviews`.* FROM `reviews` ORDER BY created_at DESC LIMIT 5
SELECT `posts`.* FROM `posts` WHERE (posts.created_at > '2010-12-31 08:00:00') ORDER BY posts.created_at DESC LIMIT 7 OFFSET 0
SELECT COUNT(DISTINCT `posts`.`id`) FROM `posts` LEFT OUTER JOIN `users` ON `users`.`id` = `posts`.`user_id` WHERE (posts.created_at > '2010-12-31 08:00:00')

  def pageless_posts

    # Time in Ruby 1.9.x requires you use (in order):
    # =>  day/month/year
    # you know, how the rest of the world does it

    @start = Time.parse("31/12/2010 01:01:01")
    @posts = Post.where('created_at >= ?', @start).order("created_at DESC").paginate(:per_page => 7, :page => params[:page].to_i)
---
SELECT COUNT(*) FROM `posts` WHERE (created_at >= '2010-12-31 09:01:01')
SELECT `posts`.* FROM `posts` WHERE (created_at >= '2010-12-31 09:01:01') ORDER BY created_at DESC LIMIT 7 OFFSET 7