app/controllers/programs_controller.rb

  def show
    if params[:id]
      @program = Program.find(params[:id])
    elsif params[:title]
       params[:title].gsub!(/\-/, " ")
       @title = params[:title]
       @title += "%"
       @program = Program.first(:conditions => ['title like ?', @title], :include => [:user, :event, :downloads, :playlists])
---
SELECT `programs`.* FROM `programs` WHERE (`programs`.`id` IN (51,275,225,271,278,255,248,190))
SELECT `downloads`.* FROM `downloads` WHERE (`downloads`.program_id = 290) AND (created_at > '2011-10-16 01:08:12') ORDER BY created_at DESC
SELECT `events`.* FROM `events` WHERE (starts_at <= '18:8' and ends_at >= '18:8' and day_i = 6) LIMIT 1
SELECT `playlists`.* FROM `playlists` WHERE (`playlists`.program_id = 290) ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT `programs`.* FROM `programs` WHERE (`programs`.`title` = 'j rau') LIMIT 1

  def edit
    @genres = Genre.all
    unless current_user.staff
      @users = User.find(:all, :conditions => ['id = ?', current_user.id])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1