app/controllers/schedules_controller.rb

  def index
    @mon = Event.find_all_by_day_i(1, :order => 'starts_at ASC')
    @tues = Event.find_all_by_day_i(2, :order => 'starts_at ASC')
    @wed = Event.find_all_by_day_i(3, :order => 'starts_at ASC')
    @thurs = Event.find_all_by_day_i(4, :order => 'starts_at ASC')
    @fri = Event.find_all_by_day_i(5, :order => 'starts_at ASC')
    @sat = Event.find_all_by_day_i(6, :order => 'starts_at ASC')
    @sun = Event.find_all_by_day_i(7, :order => 'starts_at ASC')

    @start = Event.all(:order => 'starts_at ASC')
---
SELECT `events`.* FROM `events` WHERE (starts_at <= '18:0' and ends_at >= '18:0' and day_i = 2) LIMIT 1
SELECT `events`.* FROM `events` ORDER BY starts_at ASC LIMIT 1