app/controllers/users_controller.rb

SELECT `downloads`.* FROM `downloads` WHERE (`downloads`.user_id IN (12,11,20,7,8,17,18,19,40,28,32,123,82,44,47,50,62,63,104,100,105,69,81,73,74,77,83,85,107,120,87,108,90,93,96,124,92,16,24,141,101,111,135,54,128,126,127,129,132,133,131,134,137,138,139,140,142))
SELECT `programs`.* FROM `programs` WHERE (`programs`.`id` IN (51,275,225,271,278,255,248,190))
SELECT `users`.* FROM `users` WHERE (`users`.`id` IN (12,11,20,7,8,17,18,19,40,28,32,123,82,44,47,50,62,63,104,100,105,69,81,73,74,77,83,85,107,120,87,108,90,93,96,124,92,16,24,141,101,111,135,54,128,126,127,129,132,133,131,134,137,138,139,140,142))
---
  def index

    # There are four supporting methods for this action:

    # => #get_users_by_genre #get_djs #get_top_djs #paginate_index

    # They have been split out of this method (index) to make it more readable.
    # Each of them is undernearth 'private' towards the bottom of this
    # controller. There is little to no reason to move them from the
    # private section.

    @most_popular, @most_popular_this_week, @most_downlads = get_top_djs

    # Lookup DJs by Genre, DJ, or nothing.
    # The only difference between DJs and the nothing option,
    # is that DJs makes sure they have a show on the schedule.

    if params[:genre]
      @genre, @users = get_users_by_genre(params[:genre])
    elsif params[:dj]
      @users = get_djs
    else
      @users = User.includes([:programs, :downloads]).where('users.listener != ?', 'true')

SELECT `feeds`.* FROM `feeds` WHERE (`feeds`.user_id = 1) LIMIT 1
SELECT `statuses`.* FROM `statuses` WHERE (`statuses`.`id` = 25) LIMIT 1
SELECT COUNT(*) FROM `feed_items` WHERE (`feed_items`.feed_id = 1)
SELECT `feed_items`.* FROM `feed_items` WHERE (`feed_items`.feed_id = 1) ORDER BY created_at DESC LIMIT 5 OFFSET 0
---
  def feed
    @status = Status.new
    if params[:page]
      @page = params[:page]
    else
      @page = 1
    end
    if params[:announcement]
      @url_param = "?announcement=true"
      @c = Status.where(:announcement => true)
      @f = []
      @c.each do |c|
        @fi = FeedItem.where('status_id = ? AND feed_id = ?', "#{c.id}", "#{current_user.feed.id}")
          if @fi.size > 0
            @fi.each do |f|
              @f << f.id
            end
          end
      end
      @feed = FeedItem.find(@f).paginate(:page => @page, :per_page => 5)

SELECT `playlists`.* FROM `playlists` WHERE (`playlists`.user_id = 1)
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT COUNT(*) FROM `posts` WHERE (`posts`.`user_id` = 1)
SELECT `posts`.* FROM `posts` WHERE (`posts`.`user_id` = 1) ORDER BY created_at DESC LIMIT 4 OFFSET 0
---
  def show
    @user = User.find(params[:id], :include => [:playlists])
    @page = params[:page]

    @blogs = Post.where(:user_id => @user.id).order("created_at DESC").paginate(:page => @page, :per_page => 4)

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def edit
    @lookup = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `avatar_updated_at` = '2012-01-07 20:56:38', `phone` = 5032670859, `about` = 'Salut!<br/>\r\n<br/>\r\nI\'m the guy who is responsible for the site. Instead of ramble about myself, I\'m gonna talk about the site.<br/>\r\n<br/>\r\nThe code for the site is in ruby (Rails), javascript (jQuery), html, and css. We\'re hosted on Linode (linode.com) running Debian for the server OS, with Apache as the web-server, and Passenger as our Rails server. <br/>\r\n<br/>\r\nThe database (MySQL) was converted from Drupal using custom rake tasks. There were over 130,000 playlist tracks in the previous database. Each track contained a string with all the information e.g. (\"The Beatles - Helter Skelter - White Album\") which was, split and converted into separate models to to give us the content for our artist pages.\r\n<br/>\r\nThe streaming server is in-station running FreeBSD where we have darkice and icecast serving the streams. In a nearly identical setup, the archive server records the shows and serves them up shortly after their air time.<br/>\r\n<br/>', `perishable_token` = '7u3MRriE7rvJykvzFoKC', `updated_at` = '2012-01-07 20:56:38' WHERE (`users`.`id` = 1)
---
  def update
    @user = User.find(params[:id])

    @phone = params[:user][:phone].gsub(/[^0-9]/, "")
    @user.email = params[:user][:email]

    #this checks to make sure it is not updating the password if no parameters have been entered

    if params[:user][:password]
      @user.password = params[:user][:password]
      @user.password_confirmation = params[:user][:password_confirmation]
    end

    @user.f_name = params[:user][:f_name]
    @user.l_name = params[:user][:l_name]
    if params[:user][:avatar]
      @user.avatar = params[:user][:avatar]
    end
    @user.phone = @phone.to_i
    @user.influences = params[:user][:influences]
    @user.about = params[:user][:about]
    @user.homepage = params[:user][:homepage]
    @user.age = params[:user][:age]
    @user.dj_name = params[:user][:dj_name]

    respond_to do |format|
      if @user.save