app/views/playlists/_new.html.erb

			<div class="float-left blue-text chunk-five clear-both">
			Program	<%= select_tag "programs", options_from_collection_for_select(@programs, "id", "title", :selected => "#{ current_user.programs.first.id rescue nil }") %>
---
SELECT `programs`.* FROM `programs` WHERE (`programs`.user_id = 1) LIMIT 1