app/views/playlists/_saved.js.erb

$("#new_playlist").attr("method", 'put')
$(".save-playlist").html("<i>Saved!</i>").removeClass(".save-playlist").removeClass(".pointer").addClass("black-font");
---
INSERT INTO `playlists` (`program_id`, `title`, `description`, `created_at`, `updated_at`, `nid`, `user_id`) VALUES (273, 'New Playlist', 'Dog shit', '2012-01-07 21:13:04', '2012-01-07 21:13:04', NULL, 1)