app/views/layouts/_sidebar.html.erb

	<a href="http://www.musicfestnw.com/"><div style="width:160px; height:600px; float:right;"><img src="/images/v3/mfnwskyscraper.gif" width="160px" height="600px" style="float:right;" /></div></a>
	<% Happening.where("ends_at > ?", Time.zone.now).limit(4).reverse.each do |event| %>
---
SELECT `happenings`.* FROM `happenings` WHERE (ends_at > '2012-01-09 04:49:59') LIMIT 4

	<ul class="vertical green-text dejavu-condensed">
		<% Download.where("user_id != ?", "nil").includes(:program).order("created_at DESC").limit(10).each do |d| %>
---
SELECT `downloads`.* FROM `downloads` WHERE (`downloads`.user_id IN (12,11,20,7,8,17,18,19,40,28,32,123,82,44,47,50,62,63,104,100,105,69,81,73,74,77,83,85,107,120,87,108,90,93,96,124,92,16,24,141,101,111,135,54,128,126,127,129,132,133,131,134,137,138,139,140,142))
SELECT `programs`.* FROM `programs` WHERE (`programs`.`id` IN (51,275,225,271,278,255,248,190))